参考链接：https://www.kesci.com/home/project/5ddc974ef41512002cec1dca

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'0.24.2'

In [2]:
arr = [0, 1, 2, 3, 4]
df = pd.Series(arr)
df

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
df = pd.Series(d)
df

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
dates = pd.date_range('today',periods=6) # 定义时间序列作为 index
num_arr = np.random.randn(6,4) # 传入 numpy 随机数组
columns = ['A','B','C','D'] # 将列表作为列名
df1 = pd.DataFrame(num_arr, index = dates, columns = columns)
df1

                                   A         B         C         D
2019-12-07 16:34:51.148856 -1.134388 -0.217170 -0.487728  1.606363
2019-12-08 16:34:51.148856 -1.636600  0.063970 -0.384746  0.719173
2019-12-09 16:34:51.148856 -1.680543 -0.306171  1.446711 -0.442365
2019-12-10 16:34:51.148856 -0.894470 -1.851513  0.938342  0.289500
2019-12-11 16:34:51.148856 -1.379841  0.242141 -0.332139 -1.910793
2019-12-12 16:34:51.148856  0.160428  1.380185  0.332825 -1.064304

In [5]:
dates = pd.date_range('today',periods=8) # 定义时间序列作为 index
dates

DatetimeIndex(['2019-12-07 16:34:51.167754', '2019-12-08 16:34:51.167754',
               '2019-12-09 16:34:51.167754', '2019-12-10 16:34:51.167754',
               '2019-12-11 16:34:51.167754', '2019-12-12 16:34:51.167754',
               '2019-12-13 16:34:51.167754', '2019-12-14 16:34:51.167754'],
              dtype='datetime64[ns]', freq='D')

In [6]:
# df = pd.read_csv('test.csv', encoding='gbk, sep=';')

In [7]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [8]:
# 方法一
# df.info()
# 方法二
# df.describe()

In [9]:
# integers location
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [10]:
# location
df.loc[:, ["animal", "age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [11]:
df.index[[3, 4, 8]]

Index(['d', 'e', 'i'], dtype='object')

In [12]:
df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [13]:
df[df["age"]>3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

In [14]:
df[df["age"].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [15]:
df[(df["age"]>2) & (df["age"]<4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

In [16]:
df.loc["f", "age"]=1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [17]:
df["visits"].sum()

19

In [18]:
df["priority"].sum()

'yesyesnoyesnononoyesnono'

In [19]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [20]:
df.groupby("animal")["age"].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [21]:
#插入
df.loc['k'] = [5.5, 'dog', 'no', 2]
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no
k    5.5  dog     no        2

In [22]:
# 删除
df = df.drop('k')
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no

In [23]:
df["animal"].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [24]:
df.sort_values(by=["age", "visits"], ascending=[False, True])

  animal  age visits priority
i    dog    7      2       no
e    dog    5      2       no
g  snake  4.5      1       no
j    dog    3      1       no
b    cat    3      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

In [25]:
df["priority"] = df["priority"].map({"yes": 1, "no": 0})  # 
df

  animal  age visits  priority
a    cat  2.5      1         1
b    cat    3      3         1
c  snake  0.5      2         0
d    dog  NaN      3         1
e    dog    5      2         0
f    cat  1.5      3         0
g  snake  4.5      1         0
h    cat  NaN      1         1
i    dog    7      2         0
j    dog    3      1         0

In [26]:
df["priority"] = df["priority"].map({1: True, 0: False})  # 
df

  animal  age visits  priority
a    cat  2.5      1      True
b    cat    3      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog    5      2     False
f    cat  1.5      3     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog    7      2     False
j    dog    3      1     False

In [27]:
df["animal"] = df["animal"].replace("snake", "python")
df

   animal  age visits  priority
a     cat  2.5      1      True
b     cat    3      3      True
c  python  0.5      2     False
d     dog  NaN      3      True
e     dog    5      2     False
f     cat  1.5      3     False
g  python  4.5      1     False
h     cat  NaN      1      True
i     dog    7      2     False
j     dog    3      1     False

In [28]:
# df.pivot_table(index="animal",columns="visits",values="age",aggfunc="mean")

In [29]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7, 1]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7
11  1

In [30]:
df['A'].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
11    7.0
Name: A, dtype: float64

In [31]:
df1 = df.loc[df['A'].shift() != df['A']]
df1

    A
0   1
1   2
3   3
4   4
5   5
8   6
9   7
11  1

In [32]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df1 = df.sub(df.mean(axis=1), axis=0)
print(df1)

          0         1         2
0  0.079060  0.202603  0.227456
1  0.053519  0.285745  0.169327
2  0.901050  0.037723  0.218494
3  0.970020  0.437141  0.582410
4  0.613534  0.378267  0.415820
          0         1         2
0 -0.090646  0.032896  0.057750
1 -0.116011  0.116215 -0.000203
2  0.515294 -0.348033 -0.167261
3  0.306830 -0.226049 -0.080781
4  0.144327 -0.090940 -0.053387

In [33]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df1 = df.sub(-1, axis=0)
print(df1)

          0         1         2
0  0.376627  0.536779  0.217628
1  0.583789  0.637599  0.476145
2  0.486689  0.653768  0.179731
3  0.029979  0.759317  0.596667
4  0.897850  0.139082  0.864512
          0         1         2
0  1.376627  1.536779  1.217628
1  1.583789  1.637599  1.476145
2  1.486689  1.653768  1.179731
3  1.029979  1.759317  1.596667
4  1.897850  1.139082  1.864512

In [34]:
df = pd.DataFrame(np.random.random(size=(5, 5)), columns=list('abcde'))
print(df)
df.sum()

          a         b         c         d         e
0  0.605857  0.276833  0.146077  0.220909  0.734552
1  0.084609  0.306331  0.683993  0.264197  0.643284
2  0.451636  0.723681  0.273349  0.093833  0.660817
3  0.409824  0.450200  0.552769  0.082897  0.151443
4  0.916356  0.922693  0.984351  0.826994  0.505573

a    2.468282
b    2.679739
c    2.640539
d    1.488830
e    2.695669
dtype: float64

In [35]:
df.sum().idxmin()

'd'

In [36]:
df.median()

a    0.451636
b    0.450200
c    0.552769
d    0.220909
e    0.643284
dtype: float64

In [37]:
df = pd.DataFrame({'A': list('aaabbcaabcccbbc'), 
                   'B': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
print(df)
df1 = df.groupby('A')['B'].nlargest(3).sum(level=0)
print(df1)

    A    B
0   a   12
1   a  345
2   a    3
3   b    1
4   b   45
5   c   14
6   a    4
7   a   52
8   b   54
9   c   23
10  c  235
11  c   21
12  b   57
13  b    3
14  c   87
A
a    409
b    156
c    345
Name: B, dtype: int64

In [38]:
df.groupby('A')['B'].sum()

A
a    416
b    160
c    380
Name: B, dtype: int64

In [39]:
df.groupby('A')['B'].nlargest(3).sum(level=0)

A
a    409
b    156
c    345
Name: B, dtype: int64

In [40]:
df = pd.DataFrame({'A': [1,2,11,11,33,34,35,40,79,99], 
                   'B': [1,2,11,11,33,34,35,40,79,99]})
df

    A   B
0   1   1
1   2   2
2  11  11
3  11  11
4  33  33
5  34  34
6  35  35
7  40  40
8  79  79
9  99  99

In [41]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]        3
(10, 20]      22
(20, 30]       0
(30, 40]     142
(40, 50]       0
(50, 60]       0
(60, 70]       0
(70, 80]      79
(80, 90]       0
(90, 100]     99
Name: B, dtype: int64

In [42]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].count()

A
(0, 10]      2
(10, 20]     2
(20, 30]     0
(30, 40]     4
(40, 50]     0
(50, 60]     0
(60, 70]     0
(70, 80]     1
(80, 90]     0
(90, 100]    1
Name: B, dtype: int64

In [43]:
# 28.给定DataFrame，计算每个元素至左边最近的0（或者至开头）的距离，生成新列y

df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

izero = np.r_[-1, (df['X'] == 0).to_numpy().nonzero()[0]] # 标记0的位置
idx = np.arange(len(df))
df['Y'] = idx - izero[np.searchsorted(izero - 1, idx) - 1]
print(df)

# 方法二
# x = (df['X'] != 0).cumsum()
# y = x != x.shift()
# df['Y'] = y.groupby((y != y.shift()).cumsum()).cumsum()

# 方法三
# df['Y'] = df.groupby((df['X'] == 0).cumsum()).cumcount()
#first_zero_idx = (df['X'] == 0).idxmax()
# df['Y'].iloc[0:first_zero_idx] += 1

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [44]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df.unstack().sort_values()[-3:].index.tolist()

          0         1         2
0  0.403677  0.589640  0.361653
1  0.279007  0.659376  0.708075
2  0.979146  0.437195  0.277489
3  0.811372  0.195120  0.904699
4  0.584628  0.031095  0.756097

[(0, 3), (2, 3), (0, 2)]

In [45]:
df.unstack()

0  0    0.403677
   1    0.279007
   2    0.979146
   3    0.811372
   4    0.584628
1  0    0.589640
   1    0.659376
   2    0.437195
   3    0.195120
   4    0.031095
2  0    0.361653
   1    0.708075
   2    0.277489
   3    0.904699
   4    0.756097
dtype: float64

In [46]:
df.unstack().sort_values()

1  4    0.031095
   3    0.195120
2  2    0.277489
0  1    0.279007
2  0    0.361653
0  0    0.403677
1  2    0.437195
0  4    0.584628
1  0    0.589640
   1    0.659376
2  1    0.708075
   4    0.756097
0  3    0.811372
2  3    0.904699
0  2    0.979146
dtype: float64

In [47]:
df.unstack().sort_values()[-3:]

0  3    0.811372
2  3    0.904699
0  2    0.979146
dtype: float64

In [48]:
df.unstack().sort_values()[-3:].index

MultiIndex(levels=[[0, 1, 2], [0, 1, 2, 3, 4]],
           codes=[[0, 2, 0], [3, 3, 2]])

In [49]:
df.unstack().sort_values()[-3:].index.tolist()

[(0, 3), (2, 3), (0, 2)]

In [50]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [-12,345,3,1,45,14,4,-52,54,23,-235,21,57,3,87]})

def replace(group):
    mask = group<0
    group[mask] = group[~mask].mean()
    return group

df

   grps  vals
0     a   -12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a   -52
8     b    54
9     c    23
10    c  -235
11    c    21
12    b    57
13    b     3
14    c    87

In [51]:
df.groupby(['grps'])['vals'].mean()

grps
a    57.6
b    32.0
c   -18.0
Name: vals, dtype: float64

In [52]:
df['vals_new'] = df.groupby(['grps'])['vals'].transform(replace)
df

   grps  vals    vals_new
0     a   -12  117.333333
1     a   345  345.000000
2     a     3    3.000000
3     b     1    1.000000
4     b    45   45.000000
5     c    14   14.000000
6     a     4    4.000000
7     a   -52  117.333333
8     b    54   54.000000
9     c    23   23.000000
10    c  -235   36.250000
11    c    21   21.000000
12    b    57   57.000000
13    b     3    3.000000
14    c    87   87.000000

In [53]:
# 31.计算3位滑动窗口的平均值，忽略NAN


# df = pd.DataFrame({'group': list('aabbabbbabab'),
#                     'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
# print(df)

# g1 = df.groupby(['group'])['value']
# g2 = df.fillna(0).groupby(['group'])['value'] 

# s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count()

# s.reset_index(level=0, drop=True).sort_index()

In [54]:
dti = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dti)), index=dti)

s.head(10)

2015-01-01    0.121447
2015-01-02    0.269213
2015-01-05    0.326286
2015-01-06    0.681613
2015-01-07    0.734638
2015-01-08    0.628319
2015-01-09    0.805883
2015-01-12    0.605454
2015-01-13    0.114299
2015-01-14    0.258027
Freq: B, dtype: float64

In [55]:
s[s.index.weekday == 2].sum()

25.630877993066605

In [57]:
s.resample('M').mean()

2015-01-31    0.558725
2015-02-28    0.561535
2015-03-31    0.467581
2015-04-30    0.458865
2015-05-31    0.538334
2015-06-30    0.443598
2015-07-31    0.566905
2015-08-31    0.421940
2015-09-30    0.509236
2015-10-31    0.581762
2015-11-30    0.473262
2015-12-31    0.536625
Freq: M, dtype: float64

In [58]:
s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-16
2015-05-31   2015-03-25
2015-09-30   2015-07-14
2016-01-31   2015-11-20
Freq: 4M, dtype: datetime64[ns]

In [59]:
# 36.创建2015-2016每月第三个星期四的序列
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

In [60]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [61]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [62]:
temp = df.From_To.str.split('_', expand=True)
temp.columns = ['From', 'To']
df = df.join(temp)
df = df.drop('From_To', axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [63]:
df['From'] = df['From'].str.capitalize()
df['To'] = df['To'].str.capitalize()
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [64]:
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]
df = df.drop('RecentDelays', axis=1).join(delays)

df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [83]:
df1 = pd.DataFrame(np.random.randint(0, 100, [10, 4]), columns=list("abcd"))
df1

    a   b   c   d
0  84  68  84   7
1  20  77  79  31
2  93  87  28  97
3  99  69  73  30
4  94  22   9   1
5  87  63  92   4
6  50  14  46  96
7  81  26  34  33
8  95   7  56  21
9  48  21  58  70

In [84]:
df2 = pd.DataFrame(np.random.randint(0, 100, [10, 1]), columns=list("f"))
df2

    f
0  11
1  27
2  87
3  30
4  18
5  10
6  94
7   8
8   6
9  42

In [85]:
df1.join(df2)

    a   b   c   d   f
0  84  68  84   7  11
1  20  77  79  31  27
2  93  87  28  97  87
3  99  69  73  30  30
4  94  22   9   1  18
5  87  63  92   4  10
6  50  14  46  96  94
7  81  26  34  33   8
8  95   7  56  21   6
9  48  21  58  70  42

In [86]:
dframe1 = pd.DataFrame({'key':['X','Z','Y','Z','X','X'],'value_df1': np.arange(6)})
dframe1

  key  value_df1
0   X          0
1   Z          1
2   Y          2
3   Z          3
4   X          4
5   X          5

In [87]:
dframe2 = pd.DataFrame({'key':['Q','Y','Z'],'value_df2':[1,2,3]})
dframe2

  key  value_df2
0   Q          1
1   Y          2
2   Z          3

In [88]:
pd.merge(dframe1,dframe2)

  key  value_df1  value_df2
0   Z          1          3
1   Z          3          3
2   Y          2          2

In [89]:
pd.merge(dframe1, dframe2, on="key", how="inner")

  key  value_df1  value_df2
0   Z          1          3
1   Z          3          3
2   Y          2          2

In [90]:
pd.merge(dframe1,dframe2,on='key',how='left')

  key  value_df1  value_df2
0   X          0        NaN
1   Z          1        3.0
2   Y          2        2.0
3   Z          3        3.0
4   X          4        NaN
5   X          5        NaN

In [91]:
pd.merge(dframe1,dframe2,on='key',how='right')

  key  value_df1  value_df2
0   Z        1.0          3
1   Z        3.0          3
2   Y        2.0          2
3   Q        NaN          1

In [92]:
pd.merge(dframe1,dframe2,on='key',how='outer')

  key  value_df1  value_df2
0   X        0.0        NaN
1   X        4.0        NaN
2   X        5.0        NaN
3   Z        1.0        3.0
4   Z        3.0        3.0
5   Y        2.0        2.0
6   Q        NaN        1.0

In [93]:
arr1 = np.arange(9)
arr1

array([0, 1, 2, 3, 4, 5, 6, 7, 8])

In [94]:
arr1 = np.arange(9).reshape((3,3))
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [95]:
np.concatenate([arr1,arr1],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [96]:
np.concatenate([arr1,arr1],axis=0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])